
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоглашениеПрочитано = Нейро_ОбщийМодуль.ПолучитьНастройку("ЛицензионноеСоглашение");
	Элементы.ДекорацияСоглашение.Видимость=НЕ СоглашениеПрочитано;
	
	ОКонфигурации = Нейро_ОбщийМодуль.ИнформацияОПрограмме();
	Заголовок = "Нейроконструктор "+ОКонфигурации.Версия;
	Если ОКонфигурации.Пользователь="" Тогда
		Пользователь="Бесплатное (freeware) лицензионное соглашение";
	Иначе
		Пользователь=ОКонфигурации.Пользователь;
		Элементы.Контакты.Видимость=Истина;
	КонецЕсли;
	
	Контакты=ОКонфигурации.Контакты;
	
	Обработка = Обработки.Нейро_ЛицензионноеСоглашение.Создать();
	Соглашение = Обработка.ПолучитьТекстЛицензионногоСоглашения();
	
	//Если НЕ СоглашениеПрочитано Тогда
	//	Элементы.ГруппаЛицензионноеСоглашение.Показать();
	//Иначе
	//	Элементы.ГруппаЛицензионноеСоглашение.Скрыть();
	//КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СоглашениеПрочитаноПриИзменении(Элемент)
	Нейро_ОбщийМодуль.УстановитьНастройку("ЛицензионноеСоглашение", СоглашениеПрочитано);
	Элементы.ДекорацияСоглашение.Видимость=НЕ СоглашениеПрочитано;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Элементы.ГруппаЛицензионноеСоглашение.Скрыть();
КонецПроцедуры

