
&После("ПриНачалеРаботыСистемы")
Процедура Нейро_ПриНачалеРаботыСистемы()
	Если Не Нейро_ОбщийМодуль.ПолучитьНастройку("ЛицензионноеСоглашение") Тогда
		ОткрытьФорму("ОбщаяФорма.Нейро_ФормаОКонфигурации",,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

// Среднеквадратичная ошибка - вариант наиболее часто используемой функции потерь (особенно в задачах регрессии), вычисляется как квадрат разницы между «истинным» значением целевой переменной и предсказанным сетью, усредняется в рамках одного batch_size.
