
&После("УстановкаПараметровСеанса")
Процедура Нейро_УстановкаПараметровСеанса(ТребуемыеПараметры)
	МассивКЗаписи = Новый Массив;
	Идентификатор = Новый Структура("Имя, Значение","TokenizerFromJSON","keras.preprocessing.text.text.tokenizer_from_json");
	МассивКЗаписи.Добавить(Идентификатор);
	Идентификатор = Новый Структура("Имя, Значение","СайтДокументации","https://www.tensorflow.org/api_docs/python/tf/");
	МассивКЗаписи.Добавить(Идентификатор);
	
	//Идентификатор = Новый Структура("Имя, Значение","Ид...","keras...");
	//МассивКЗаписи.Добавить(Идентификатор);
	
	НаборЗаписей = РегистрыСведений.Нейро_Идентификаторы.СоздатьНаборЗаписей();
	Для Каждого Идентификатор Из МассивКЗаписи Цикл
		НаборЗаписей.Отбор.Имя.Установить(Идентификатор.Имя);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НовыйНомер = НаборЗаписей.Добавить();
			НовыйНомер.Имя = Идентификатор.Имя;
			НовыйНомер.Значение = Идентификатор.Значение;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
	МассивКЗаписи = Новый Массив;
	Идентификатор = Новый Структура("Имя, Значение, Описание","ИспользоватьGraphviz",Ложь,"Создание графической схемы при компоновке модели");
	МассивКЗаписи.Добавить(Идентификатор);
	Идентификатор = Новый Структура("Имя, Значение, Описание","УдалятьФайлыПослеВыполнения",Истина,"Удалять временные файлы созданные для запуска программы на Питон, а также результаты её выполнения");
	МассивКЗаписи.Добавить(Идентификатор);
	Идентификатор = Новый Структура("Имя, Значение, Описание","ИспользоватьВстроенныйKeras",Ложь,"Если включено, вместо keras используется tensorflow.keras as keras");
	МассивКЗаписи.Добавить(Идентификатор);
	Идентификатор = Новый Структура("Имя, Значение, Описание","numpy_allow_pickle",Ложь,"Параметр используется при загрузке массивов с диска. В актуальных версиях Numpy этот параметр обязателен, но может исчезнуть со временем");
	МассивКЗаписи.Добавить(Идентификатор);
	Идентификатор = Новый Структура("Имя, Значение, Описание","fit_generator",Истина,"Синтаксис вызова генератора в предыдущих версиях Tensorflow (ниже 2.2)");
	МассивКЗаписи.Добавить(Идентификатор);
	Идентификатор = Новый Структура("Имя, Значение, Описание","ЛицензионноеСоглашение",Ложь,"Используйте программу только после ознакомления с лицензионным соглашением и согласием с его условиями");
	МассивКЗаписи.Добавить(Идентификатор);
	НаборЗаписей = РегистрыСведений.Нейро_Настройки.СоздатьНаборЗаписей();
	Для Каждого СтруктураНастроек Из МассивКЗаписи Цикл
		НаборЗаписей.Отбор.Имя.Установить(СтруктураНастроек.Имя);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НовыйНомер = НаборЗаписей.Добавить();
			НовыйНомер.Имя = СтруктураНастроек.Имя;
			НовыйНомер.Значение = СтруктураНастроек.Значение;
			НовыйНомер.Описание = СтруктураНастроек.Описание;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры
