
&НаКлиенте
Процедура ОК(Команда)
	Закрыть(КлассыИзображений);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("КлассыИзображений") Тогда
		Для Каждого СтрокаИз Из Параметры.КлассыИзображений Цикл
			НоваяСтрока = КлассыИзображений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИз);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура НазначитьКласс(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект);
	ПоказатьВводЧисла(Оповещение, 0, "Введите количество", 6, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества(Число, Параметры) Экспорт
	Если Число = Неопределено Тогда Возврат КонецЕсли;
	Для Каждого ИдСтроки Из Элементы.КлассыИзображений.ВыделенныеСтроки Цикл
		КлассыИзображений.НайтиПоИдентификатору(ИдСтроки).НомерКласса=Число;
	КонецЦикла;
КонецПроцедуры;	

