
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Сообщения") Тогда
		Если Параметры.Сообщения.НомераСтрок.Количество()>0 Тогда
			Для Каждого НомерСтроки Из Параметры.Сообщения.НомераСтрок Цикл
				Если НомераСтрок<>"" Тогда НомераСтрок=НомераСтрок+", " КонецЕсли;
				НомераСтрок=НомераСтрок+СокрЛП(НомерСтроки);
			КонецЦикла;
		КонецЕсли;
		Если Параметры.Сообщения.Ошибки.Количество()>0 Тогда
			Для Каждого ТекстОшибки Из Параметры.Сообщения.Ошибки Цикл
				Сообщения.ДобавитьСтроку(ТекстОшибки);
				//Сообщения=Сообщения+ТекстОшибки+Символы.ВК;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
