&НаКлиенте
Процедура СообщитьОбОшибке(Поле, Текст)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Поле = Поле;
	Сообщение.Сообщить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ПутьККаталогу   = Нейро_ОбщийМодуль.ПолучитьИдентификаторИзРегистра("ПутьTensorBoard");
	//ЛокальныйАдрес  = Нейро_ОбщийМодуль.ПолучитьИдентификаторИзРегистра("WebАдресTensorBoard");
	//Порт            = Нейро_ОбщийМодуль.ПолучитьИдентификаторИзРегистра("ПортTensorBoard");
КонецПроцедуры

&НаКлиенте
Процедура ПутьККаталогуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ПутьКФайлу=Элемент.ТекстРедактирования;
	ДиалогОткрытияФайла.Каталог=ПутьКФайлу;
	ДиалогОткрытияФайла.Заголовок = "Укажите имя каталога для сохранения";	
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ОпОп = Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбораКаталогаTensorBoard", ЭтотОбъект);
	ДиалогОткрытияФайла.Показать(ОпОп);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбораКаталогаTensorBoard(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы=Неопределено Тогда Возврат КонецЕсли;
	ПутьККаталогу = ВыбранныеФайлы[0];
	Нейро_ОбщийМодуль.УстановитьИдентификатор("ПутьTensorBoard", ПутьККаталогу)
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСервер(Команда)
	Если СокрЛП(ПутьККаталогу)="" Тогда
		СообщитьОбОшибке("ПутьККаталогу", "Укажите каталог файлов журнала для TensorBoard!");
		Возврат;
	КонецЕсли;
	ПараметрКаталог = " --logdir "+ПутьККаталогу;
	ПараметрАдрес = ?(ЛокальныйАдрес="",""," --host "+ЛокальныйАдрес);
	ПараметрПорт = ?(Порт="",""," --port "+Порт);
	СтрокаКоманды = "tensorboard"+ПараметрКаталог+ПараметрАдрес+ПараметрПорт;
	НачатьЗапускПриложения(Новый ОписаниеОповещения, СтрокаКоманды, , Ложь);
КонецПроцедуры
