
Функция ПолучитьТекстЛицензионногоСоглашения() Экспорт
	ИмяфайлаЛС = "LicenseAgreement.txt";
	ИмяВременногоФайлаZIP = ПолучитьИмяВременногоФайла("zip");
	ДвоичныеДанные = ПолучитьМакет("Макет");
	ДвоичныеДанные.Записать(ИмяВременногоФайлаZIP);
	
	// Извлекаем из ZIP-архива файл и сохраняем его во временный файл
	ЧтениеZIP = Новый ЧтениеZipФайла(ИмяВременногоФайлаZIP, "d*br#xlSw6HUGAmowrITIcrIp$ICHuW9itoje*O!I*lto1o@UcR?*ru&um4cHa");
	ЭлементZIPАрхива = ЧтениеZIP.Элементы.Найти(ИмяфайлаЛС);
	ЧтениеZIP.Извлечь(ЭлементZIPАрхива, КаталогВременныхФайлов(), 
	РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	ЧтениеZIP.Закрыть();
	
	ЧтениеТекста = Новый ЧтениеТекста(КаталогВременныхФайлов() + ИмяфайлаЛС);
	ТекстЛС = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	Возврат ТекстЛС
КонецФункции