
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Режим=1 Тогда
		Если Параметры.Свойство("МассивОГенераторах") Тогда
			ЭлементыДЗ = ДЗ.ПолучитьЭлементы();
			Для Каждого СтруктураГенератора Из Параметры.МассивОГенераторах Цикл
				Элемент = ЭлементыДЗ.Добавить();
				Элемент.Свойство = "Генератор";
				Элемент.Значение = СтруктураГенератора.Генератор;
				ДобавитьЗначенияВДерево(Элемент.ПолучитьЭлементы(), СтруктураГенератора.Значения);
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли Параметры.Режим=2 Тогда
		ЭлементыДЗ = ДЗ.ПолучитьЭлементы();
		Для Каждого КиЗ Из Параметры.Нормализация Цикл
			Элемент = ЭлементыДЗ.Добавить();
			Элемент.Свойство = "Слой";
			Элемент.Значение = КиЗ.Значение.layer;
			Если КиЗ.Значение.type=2 Тогда
				Элемент1 = Элемент.ПолучитьЭлементы().Добавить();
				Элемент1.Свойство = "Уникальных значений";
				Элемент1.Значение = КиЗ.Значение.unique;
			ИначеЕсли КиЗ.Значение.type=0 Тогда
				Элемент1 = Элемент.ПолучитьЭлементы().Добавить();
				Элемент1.Свойство = "Среднее арифметическое";
				Элемент1.Значение = СокрЛП(КиЗ.Значение.mean.Количество())+" элементов";
				ЭлементыДЗ1 = Элемент1.ПолучитьЭлементы();
				Для Сч=0 По КиЗ.Значение.mean.Количество()-1 Цикл
					Элемент2 = ЭлементыДЗ1.Добавить();
					Элемент2.Свойство = СокрЛП(Сч);
					Если ТипЗнч(КиЗ.Значение.mean[Сч])=Тип("Массив") Тогда
						ДобавитьЗначенияИзМассива(Элемент2.ПолучитьЭлементы(), КиЗ.Значение.mean[Сч])
					Иначе
						Элемент2.Значение = КиЗ.Значение.mean[Сч];
					КонецЕсли;
				КонецЦикла;
				Элемент1 = Элемент.ПолучитьЭлементы().Добавить();
				Элемент1.Свойство = "Стандартное отклонение";
				Элемент1.Значение = СокрЛП(КиЗ.Значение.std.Количество())+" элементов";
				ЭлементыДЗ1 = Элемент1.ПолучитьЭлементы();
				Для Сч=0 По КиЗ.Значение.std.Количество()-1 Цикл
					Элемент2 = ЭлементыДЗ1.Добавить();
					Элемент2.Свойство = СокрЛП(Сч);
					Если ТипЗнч(КиЗ.Значение.std[Сч])=Тип("Массив") Тогда
						ДобавитьЗначенияИзМассива(Элемент2.ПолучитьЭлементы(), КиЗ.Значение.std[Сч])
					Иначе
						Элемент2.Значение = КиЗ.Значение.std[Сч];
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли КиЗ.Значение.type=1 Или КиЗ.Значение.type=3 Тогда
				ДочерниеЭлементы=Элемент.ПолучитьЭлементы();
				Элемент1 = ДочерниеЭлементы.Добавить();
				Элемент1.Свойство = "Просмотрено образцов";
				Элемент1.Значение = КиЗ.Значение.n_samples_seen_;
				Элемент1 = ДочерниеЭлементы.Добавить();
				Элемент1.Свойство = "Диапазон масштабирования";
				ТекстДиапазон = "";
				Для Каждого Значение Из КиЗ.Значение.feature_range Цикл
					Если ТекстДиапазон<>"" Тогда ТекстДиапазон=ТекстДиапазон+", " КонецЕсли;
					ТекстДиапазон=ТекстДиапазон+СокрЛП(Значение);
				КонецЦикла;
				Если ТекстДиапазон<>"" Тогда ТекстДиапазон="("+ТекстДиапазон+")" КонецЕсли;
				Элемент1.Значение = ТекстДиапазон;
				Элемент1 = ДочерниеЭлементы.Добавить();
				Элемент1.Свойство = "Данные";
				//Элемент1.Значение = КиЗ.Значение.n_samples_seen_;
				ДочерниеЭлементы1=Элемент1.ПолучитьЭлементы();
				Элемент2 = ДочерниеЭлементы1.Добавить();
				Элемент2.Свойство = "Минимумы";
				Элемент2.Значение = СокрЛП(КиЗ.Значение.data_min_.Количество())+" элементов";
				ДочерниеЭлементы2=Элемент2.ПолучитьЭлементы();
				Для Сч=0 По КиЗ.Значение.data_min_.Количество()-1 Цикл
					Элемент3 = ДочерниеЭлементы2.Добавить();
					Элемент3.Свойство = СокрЛП(Сч);
					Элемент3.Значение = КиЗ.Значение.data_min_[Сч];
				КонецЦикла;
				Элемент2 = ДочерниеЭлементы1.Добавить();
				Элемент2.Свойство = "Максимумы";
				Элемент2.Значение = СокрЛП(КиЗ.Значение.data_max_.Количество())+" элементов";
				ДочерниеЭлементы2=Элемент2.ПолучитьЭлементы();
				Для Сч=0 По КиЗ.Значение.data_max_.Количество()-1 Цикл
					Элемент3 = ДочерниеЭлементы2.Добавить();
					Элемент3.Свойство = СокрЛП(Сч);
					Элемент3.Значение = КиЗ.Значение.data_max_[Сч];
				КонецЦикла;
				Элемент2 = ДочерниеЭлементы1.Добавить();
				Элемент2.Свойство = "Диапазоны";
				Элемент2.Значение = СокрЛП(КиЗ.Значение.data_range_.Количество())+" элементов";
				ДочерниеЭлементы2=Элемент2.ПолучитьЭлементы();
				Для Сч=0 По КиЗ.Значение.data_range_.Количество()-1 Цикл
					Элемент3 = ДочерниеЭлементы2.Добавить();
					Элемент3.Свойство = СокрЛП(Сч);
					Элемент3.Значение = КиЗ.Значение.data_range_[Сч];
				КонецЦикла;
				Элемент1 = ДочерниеЭлементы.Добавить();
				Элемент1.Свойство = "Минимумы";
				Элемент1.Значение = СокрЛП(КиЗ.Значение.min_.Количество())+" элементов";
				ДочерниеЭлементы1=Элемент1.ПолучитьЭлементы();
				Для Сч=0 По КиЗ.Значение.min_.Количество()-1 Цикл
					Элемент2 = ДочерниеЭлементы1.Добавить();
					Элемент2.Свойство = СокрЛП(Сч);
					Элемент2.Значение = КиЗ.Значение.min_[Сч];
				КонецЦикла;
				Элемент1 = ДочерниеЭлементы.Добавить();
				Элемент1.Свойство = "Масштабы";
				Элемент1.Значение = СокрЛП(КиЗ.Значение.scale_.Количество())+" элементов";
				ДочерниеЭлементы1=Элемент1.ПолучитьЭлементы();
				Для Сч=0 По КиЗ.Значение.scale_.Количество()-1 Цикл
					Элемент2 = ДочерниеЭлементы1.Добавить();
					Элемент2.Свойство = СокрЛП(Сч);
					Элемент2.Значение = КиЗ.Значение.scale_[Сч];
				КонецЦикла;
			КонецЕсли;
			//Для Каждого СтрокаОбразцы Из Объект.Образцы Цикл
			//	Если СтрокаОбразцы.ИмяСлоя = КиЗ.Значение.layer Тогда
			//		//СтруктураГенератор = Новый Структура("Слой, Генератор, Значения");
			//		//СтруктураГенератор.Слой = КиЗ.Значение.layer;
			//		//СтруктураГенератор.Генератор = СтрокаОбразцы.ИмяГенератора;
			//		//СтруктураГенератор.Значения = КиЗ.Значение.generators;
			//		//МассивОГенераторах.Добавить(СтруктураГенератор);
			//		//Прервать;
			//	КонецЕсли;
			//КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначенияИзМассива(ЭлементыДЗ, МассивЗначений)
	Для Сч=0 По МассивЗначений.Количество()-1 Цикл
		Элемент2 = ЭлементыДЗ.Добавить();
		Элемент2.Свойство = СокрЛП(Сч);
		Если ТипЗнч(МассивЗначений[Сч])=Тип("Массив") Тогда
			ДобавитьЗначенияИзМассива(Элемент2.ПолучитьЭлементы(), МассивЗначений[Сч])
		Иначе
			Элемент2.Значение = МассивЗначений[Сч];
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначенияВДерево(ЭлементыДЗ, Значения)
	Сч=0;
	Для Каждого Значение Из Значения Цикл
		Элемент = ЭлементыДЗ.Добавить();
		Элемент.Свойство = "Вид";
		Если Сч=0 Тогда
			Элемент.Значение = "Тренировочный";
		ИначеЕсли Сч=1 Тогда
			Элемент.Значение = "Проверочный";
		Иначе
			Элемент.Значение = СокрЛП(Сч);
		КонецЕсли;
		ЭлементыДЗ1 = Элемент.ПолучитьЭлементы();
		Элемент1 = ЭлементыДЗ1.Добавить();
		Элемент1.Свойство = "Количество";
		Элемент1.Значение = Значение.length;
		//Элемент1 = ЭлементыДЗ1.Добавить();
		//Элемент1.Свойство = "Классы";
		Если Значение.class_indices=Неопределено Или Значение.class_indices=Null Тогда
			//Элемент1.Значение = 0;
		Иначе
			Элемент1 = ЭлементыДЗ1.Добавить();
			Элемент1.Свойство = "Классы";
			Элемент1.Значение = Значение.class_indices.Количество();
			ДобавитьЗначенияКлассовВДерево(Элемент1.ПолучитьЭлементы(), Значение.class_indices);
		КонецЕсли;
		Сч = Сч+1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначенияКлассовВДерево(ЭлементыДЗ, Значения)
	Для Каждого Значение Из Значения Цикл
		Элемент = ЭлементыДЗ.Добавить();
		Элемент.Свойство = Значение.Ключ;
		Элемент.Значение = Значение.Значение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого Элемент Из ДЗ.ПолучитьЭлементы() Цикл
		Элементы.ДЗ.Развернуть(Элемент.ПолучитьИдентификатор(),Истина);
	КонецЦикла;
КонецПроцедуры
