&НаСервере
Функция ПроверитьКлассыИзображений(Объект, ИндексДеления) Экспорт
	МассивСтрокПроверка=Новый Массив; 
	МассивСтрок=Новый Массив; 
	Для Сч=0 По Объект.Данные.Количество()-1 Цикл
		Если Сч<ИндексДеления Тогда
			МассивСтрокПроверка.Добавить(Объект.Данные.Получить(Сч));
		Иначе
			МассивСтрок.Добавить(Объект.Данные.Получить(Сч));
		КонецЕсли;
	КонецЦикла;
	ТабУчебные = Объект.Данные.Выгрузить(МассивСтрок, "Колонка");
	ТабУчебныеКлассы=ТабУчебные.Скопировать();
	ТабПроверочные = Объект.Данные.Выгрузить(МассивСтрокПроверка, "Колонка");
	ТабПроверочныеКлассы=ТабПроверочные.Скопировать();
	ТабУчебныеКлассы.Свернуть("Колонка");
	ТабПроверочныеКлассы.Свернуть("Колонка");
	МассивНеНайденоУчебные=Новый Массив;
	МассивНеНайденоПроверочные=Новый Массив;
	Для Каждого СтрокаУчебные Из ТабУчебныеКлассы Цикл
		Если ТабПроверочныеКлассы.Найти(СтрокаУчебные.Колонка, "Колонка")=Неопределено Тогда
			МассивНеНайденоУчебные.Добавить(СтрокаУчебные.Колонка);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаПроверочные Из ТабПроверочныеКлассы Цикл
		Если ТабУчебныеКлассы.Найти(СтрокаПроверочные.Колонка, "Колонка")=Неопределено Тогда
			МассивНеНайденоПроверочные.Добавить(СтрокаПроверочные.Колонка);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура("Ошибка, МассивУчебные, МассивПроверочные",Ложь);
	Если МассивНеНайденоУчебные.Количество()>0 Или МассивНеНайденоПроверочные.Количество()>0 Тогда
		Результат.Ошибка = Истина;
		Результат.МассивУчебные = МассивНеНайденоУчебные;
		Результат.МассивПроверочные = МассивНеНайденоПроверочные;
	КонецЕсли;
	Возврат Результат
КонецФункции

&НаСервере
Процедура ПеремешатьСтроки() Экспорт
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Если Данные.Количество()=0 Тогда Возврат КонецЕсли;
	МассивИндексов = Новый Массив(Данные.Количество());
	ВсегоЭлементов = Данные.Количество()-1;
	Для Сч=0 По Данные.Количество()-1 Цикл
		Пока Истина Цикл
			СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, ВсегоЭлементов);   
			Если МассивИндексов.Найти(СлучайноеЧисло)=Неопределено Тогда
				МассивИндексов[Сч]=СлучайноеЧисло;
				Прервать
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Тз=Данные.Выгрузить();
	Тз.ЗагрузитьКолонку(МассивИндексов,"НомерСтроки");
	Тз.Сортировать("НомерСтроки");
	Данные.Загрузить(Тз);
КонецПроцедуры